#Дано текстовий файл, що вміщає довільний текст. Необхідно розробити застосунок, що виведе кількість слів і символів для кожного рядку тексту з текстового файлу.
file = ''
while file == '':
    try:#Перевірка файлу на існування
        file = open(input('ВВедіть назву файлу у форматі "name.txt"'), 'r').readlines()#Одразу відкриваємо input користувача у читанні строк. 
    except:
        print('Файл з введеною назвою не існує. Спробуйте ще раз.')
i = 1
for line in file:
    if len(line[:-2]) != 0:#Завдання полягає у читанні рядків ТЕКСТУ, тож прибираємо пусті рядки, які містять тільки \n
        print(f"Абзац {i}. \nКількість слів - {len(line[:-2].split(' '))}. Кількість символів - {len(line[:-2])}")
        i+=1
